ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Defs.h
// CS0CN (Capacitive Sense 0 Control)
#define SFR_CS0CN 0xB0
SBIT (CS0CN_CSCMPF,  SFR_CS0CN, 0); ///< CS0 Digital Comparator Interrupt Flag
SBIT (CS0CN_CSPME,   SFR_CS0CN, 1); ///< CS0 Pin Monitor Event                
SBIT (CS0CN_CSCMPEN, SFR_CS0CN, 3); ///< CS0 Digital Comparator Enable        
SBIT (CS0CN_CSBUSY,  SFR_CS0CN, 4); ///< CS0 Busy                             
SBIT (CS0CN_CSINT,   SFR_CS0CN, 5); ///< CS0 Interrupt Flag                   
SBIT (CS0CN_CSEOS,   SFR_CS0CN, 6); ///< CS0 End of Scan Interrupt Flag       
SBIT (CS0CN_CSEN,    SFR_CS0CN, 7); ///< CS0 Enable                           

// DMA0INT (DMA0 Full-Length Interrupt Flags)
#define SFR_DMA0INT 0xE8
SBIT (DMA0INT_CH0I, SFR_DMA0INT, 0); ///< Channel 0 Full-Length Interrupt Flag
SBIT (DMA0INT_CH1I, SFR_DMA0INT, 1); ///< Channel 1 Full-Length Interrupt Flag
SBIT (DMA0INT_CH2I, SFR_DMA0INT, 2); ///< Channel 2 Full-Length Interrupt Flag
SBIT (DMA0INT_CH3I, SFR_DMA0INT, 3); ///< Channel 3 Full-Length Interrupt Flag
SBIT (DMA0INT_CH4I, SFR_DMA0INT, 4); ///< Channel 4 Full-Length Interrupt Flag
SBIT (DMA0INT_CH5I, SFR_DMA0INT, 5); ///< Channel 5 Full-Length Interrupt Flag
SBIT (DMA0INT_CH6I, SFR_DMA0INT, 6); ///< Channel 6 Full-Length Interrupt Flag

// DMA0MINT (DMA0 Mid-Point Interrupt Flags)
#define SFR_DMA0MINT 0x88
SBIT (DMA0MINT_CH0MI, SFR_DMA0MINT, 0); ///< Channel 0 Mid-Point Interrupt Flag
SBIT (DMA0MINT_CH1MI, SFR_DMA0MINT, 1); ///< Channel 1 Mid-Point Interrupt Flag
SBIT (DMA0MINT_CH2MI, SFR_DMA0MINT, 2); ///< Channel 2 Mid-Point Interrupt Flag
SBIT (DMA0MINT_CH3MI, SFR_DMA0MINT, 3); ///< Channel 3 Mid-Point Interrupt Flag
SBIT (DMA0MINT_CH4MI, SFR_DMA0MINT, 4); ///< Channel 4 Mid-Point Interrupt Flag
SBIT (DMA0MINT_CH5MI, SFR_DMA0MINT, 5); ///< Channel 5 Mid-Point Interrupt Flag
SBIT (DMA0MINT_CH6MI, SFR_DMA0MINT, 6); ///< Channel 6 Mid-Point Interrupt Flag

// DMA0NCF (DMA0 Channel Configuration)
#define SFR_DMA0NCF 0xD8
SBIT (DMA0NCF_PERIPH0, SFR_DMA0NCF, 0); ///< Peripheral Transfer Select Bit 0
SBIT (DMA0NCF_PERIPH1, SFR_DMA0NCF, 1); ///< Peripheral Transfer Select Bit 1
SBIT (DMA0NCF_PERIPH2, SFR_DMA0NCF, 2); ///< Peripheral Transfer Select Bit 2
SBIT (DMA0NCF_ENDIAN,  SFR_DMA0NCF, 4); ///< Data Transfer Endianness        
SBIT (DMA0NCF_STALL,   SFR_DMA0NCF, 5); ///< Channel Stall                   
SBIT (DMA0NCF_MIEN,    SFR_DMA0NCF, 6); ///< Mid-Point Interrupt Enable      
SBIT (DMA0NCF_IEN,     SFR_DMA0NCF, 7); ///< Full-Length Interrupt Enable    

// I2C0STAT (I2C0 Status)
#define SFR_I2C0STAT 0xF8
SBIT (I2C0STAT_RD,      SFR_I2C0STAT, 0); ///< I2C Read       
SBIT (I2C0STAT_WR,      SFR_I2C0STAT, 1); ///< I2C Write      
SBIT (I2C0STAT_STOP,    SFR_I2C0STAT, 2); ///< Stop           
SBIT (I2C0STAT_START,   SFR_I2C0STAT, 3); ///< Start          
SBIT (I2C0STAT_NACK,    SFR_I2C0STAT, 4); ///< NACK           
SBIT (I2C0STAT_I2C0INT, SFR_I2C0STAT, 5); ///< I2C Interrupt  
SBIT (I2C0STAT_ACTIVE,  SFR_I2C0STAT, 6); ///< Bus Active     
SBIT (I2C0STAT_HSMODE,  SFR_I2C0STAT, 7); ///< High Speed Mode

// IE (Interrupt Enable)
#define SFR_IE 0xA8
SBIT (IE_EX0,   SFR_IE, 0); ///< External Interrupt 0 Enable
SBIT (IE_ET0,   SFR_IE, 1); ///< Timer 0 Interrupt Enable   
SBIT (IE_EX1,   SFR_IE, 2); ///< External Interrupt 1 Enable
SBIT (IE_ET1,   SFR_IE, 3); ///< Timer 1 Interrupt Enable   
SBIT (IE_ES0,   SFR_IE, 4); ///< UART0 Interrupt Enable     
SBIT (IE_ET2,   SFR_IE, 5); ///< Timer 2 Interrupt Enable   
SBIT (IE_ESPI0, SFR_IE, 6); ///< SPI0 Interrupt Enable      
SBIT (IE_EA,    SFR_IE, 7); ///< All Interrupts Enable      

// IP (Interrupt Priority)
#define SFR_IP 0xB8
SBIT (IP_PX0,   SFR_IP, 0); ///< External Interrupt 0 Priority Control                        
SBIT (IP_PT0,   SFR_IP, 1); ///< Timer 0 Interrupt Priority Control                           
SBIT (IP_PX1,   SFR_IP, 2); ///< External Interrupt 1 Priority Control                        
SBIT (IP_PT1,   SFR_IP, 3); ///< Timer 1 Interrupt Priority Control                           
SBIT (IP_PS0,   SFR_IP, 4); ///< UART0 Interrupt Priority Control                             
SBIT (IP_PT2,   SFR_IP, 5); ///< Timer 2 Interrupt Priority Control                           
SBIT (IP_PSPI0, SFR_IP, 6); ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control

// MAC0CF0 (MAC0 Configuration 0)
#define SFR_MAC0CF0 0xC0
SBIT (MAC0CF0_ANEGATE,   SFR_MAC0CF0, 0); ///< Negate A input             
SBIT (MAC0CF0_BNEGATE,   SFR_MAC0CF0, 1); ///< Negate B input             
SBIT (MAC0CF0_ACCNEGATE, SFR_MAC0CF0, 2); ///< Negate Accumulator Input   
SBIT (MAC0CF0_ACCMD,     SFR_MAC0CF0, 3); ///< Accumulate Mode            
SBIT (MAC0CF0_FRACMD,    SFR_MAC0CF0, 4); ///< Fractional Mode            
SBIT (MAC0CF0_CLRACC,    SFR_MAC0CF0, 5); ///< Clear Accumulator          
SBIT (MAC0CF0_SHIFTDIR,  SFR_MAC0CF0, 6); ///< Accumulator Shift Direction
SBIT (MAC0CF0_SHIFTEN,   SFR_MAC0CF0, 7); ///< Accumulator Shift Control  

// P0 (Port 0 Pin Latch)
#define SFR_P0 0x80
SBIT (P0_B0, SFR_P0, 0); ///< Port 0 Bit 0 Latch
SBIT (P0_B1, SFR_P0, 1); ///< Port 0 Bit 1 Latch
SBIT (P0_B2, SFR_P0, 2); ///< Port 0 Bit 2 Latch
SBIT (P0_B3, SFR_P0, 3); ///< Port 0 Bit 3 Latch
SBIT (P0_B4, SFR_P0, 4); ///< Port 0 Bit 4 Latch
SBIT (P0_B5, SFR_P0, 5); ///< Port 0 Bit 5 Latch
SBIT (P0_B6, SFR_P0, 6); ///< Port 0 Bit 6 Latch
SBIT (P0_B7, SFR_P0, 7); ///< Port 0 Bit 7 Latch

// P1 (Port 1 Pin Latch)
#define SFR_P1 0x90
SBIT (P1_B0, SFR_P1, 0); ///< Port 1 Bit 0 Latch
SBIT (P1_B1, SFR_P1, 1); ///< Port 1 Bit 1 Latch
SBIT (P1_B2, SFR_P1, 2); ///< Port 1 Bit 2 Latch
SBIT (P1_B3, SFR_P1, 3); ///< Port 1 Bit 3 Latch
SBIT (P1_B4, SFR_P1, 4); ///< Port 1 Bit 4 Latch
SBIT (P1_B5, SFR_P1, 5); ///< Port 1 Bit 5 Latch
SBIT (P1_B6, SFR_P1, 6); ///< Port 1 Bit 6 Latch
SBIT (P1_B7, SFR_P1, 7); ///< Port 1 Bit 7 Latch

// P2 (Port 2 Pin Latch)
#define SFR_P2 0xA0
SBIT (P2_B0, SFR_P2, 0); ///< Port 2 Bit 0 Latch
SBIT (P2_B1, SFR_P2, 1); ///< Port 2 Bit 1 Latch
SBIT (P2_B2, SFR_P2, 2); ///< Port 2 Bit 2 Latch
SBIT (P2_B3, SFR_P2, 3); ///< Port 2 Bit 3 Latch
SBIT (P2_B4, SFR_P2, 4); ///< Port 2 Bit 4 Latch
SBIT (P2_B5, SFR_P2, 5); ///< Port 2 Bit 5 Latch
SBIT (P2_B6, SFR_P2, 6); ///< Port 2 Bit 6 Latch
SBIT (P2_B7, SFR_P2, 7); ///< Port 2 Bit 7 Latch

// PCA0CN (PCA Control)
#define SFR_PCA0CN 0xD8
SBIT (PCA0CN_CCF0, SFR_PCA0CN, 0); ///< PCA Module 0 Capture/Compare Flag
SBIT (PCA0CN_CCF1, SFR_PCA0CN, 1); ///< PCA Module 1 Capture/Compare Flag
SBIT (PCA0CN_CCF2, SFR_PCA0CN, 2); ///< PCA Module 2 Capture/Compare Flag
SBIT (PCA0CN_CR,   SFR_PCA0CN, 6); ///< PCA Counter/Timer Run Control    
SBIT (PCA0CN_CF,   SFR_PCA0CN, 7); ///< PCA Counter/Timer Overflow Flag  

// PSW (Program Status Word)
#define SFR_PSW 0xD0
SBIT (PSW_PARITY, SFR_PSW, 0); ///< Parity Flag               
SBIT (PSW_F1,     SFR_PSW, 1); ///< User Flag 1               
SBIT (PSW_OV,     SFR_PSW, 2); ///< Overflow Flag             
SBIT (PSW_RS0,    SFR_PSW, 3); ///< Register Bank Select Bit 0
SBIT (PSW_RS1,    SFR_PSW, 4); ///< Register Bank Select Bit 1
SBIT (PSW_F0,     SFR_PSW, 5); ///< User Flag 0               
SBIT (PSW_AC,     SFR_PSW, 6); ///< Auxiliary Carry Flag      
SBIT (PSW_CY,     SFR_PSW, 7); ///< Carry Flag                

