ahtn/keyplus/ports/efm8/efm8/mcu/C8051F970/inc/SI_C8051F970_Defs.h
// SCON0 (UART0 Serial Port Control)
#define SFR_SCON0 0x98
SBIT (SCON0_RI,    SFR_SCON0, 0); ///< Receive Interrupt Flag             
SBIT (SCON0_TI,    SFR_SCON0, 1); ///< Transmit Interrupt Flag            
SBIT (SCON0_RB8,   SFR_SCON0, 2); ///< Ninth Receive Bit                  
SBIT (SCON0_TB8,   SFR_SCON0, 3); ///< Ninth Transmission Bit             
SBIT (SCON0_REN,   SFR_SCON0, 4); ///< Receive Enable                     
SBIT (SCON0_MCE,   SFR_SCON0, 5); ///< Multiprocessor Communication Enable
SBIT (SCON0_SMODE, SFR_SCON0, 7); ///< Serial Port 0 Operation Mode       

// SMB0CN (SMBus 0 Control)
#define SFR_SMB0CN 0xC0
SBIT (SMB0CN_SI,      SFR_SMB0CN, 0); ///< SMBus Interrupt Flag            
SBIT (SMB0CN_ACK,     SFR_SMB0CN, 1); ///< SMBus Acknowledge               
SBIT (SMB0CN_ARBLOST, SFR_SMB0CN, 2); ///< SMBus Arbitration Lost Indicator
SBIT (SMB0CN_ACKRQ,   SFR_SMB0CN, 3); ///< SMBus Acknowledge Request       
SBIT (SMB0CN_STO,     SFR_SMB0CN, 4); ///< SMBus Stop Flag                 
SBIT (SMB0CN_STA,     SFR_SMB0CN, 5); ///< SMBus Start Flag                
SBIT (SMB0CN_TXMODE,  SFR_SMB0CN, 6); ///< SMBus Transmit Mode Indicator   
SBIT (SMB0CN_MASTER,  SFR_SMB0CN, 7); ///< SMBus Master/Slave Indicator    

// SPI0CN (SPI0 Control)
#define SFR_SPI0CN 0xF8
SBIT (SPI0CN_SPIEN,  SFR_SPI0CN, 0); ///< SPI0 Enable            
SBIT (SPI0CN_TXBMT,  SFR_SPI0CN, 1); ///< Transmit Buffer Empty  
SBIT (SPI0CN_NSSMD0, SFR_SPI0CN, 2); ///< Slave Select Mode Bit 0
SBIT (SPI0CN_NSSMD1, SFR_SPI0CN, 3); ///< Slave Select Mode Bit 1
SBIT (SPI0CN_RXOVRN, SFR_SPI0CN, 4); ///< Receive Overrun Flag   
SBIT (SPI0CN_MODF,   SFR_SPI0CN, 5); ///< Mode Fault Flag        
SBIT (SPI0CN_WCOL,   SFR_SPI0CN, 6); ///< Write Collision Flag   
SBIT (SPI0CN_SPIF,   SFR_SPI0CN, 7); ///< SPI0 Interrupt Flag    

// TCON (Timer 0/1 Control)
#define SFR_TCON 0x88
SBIT (TCON_IT0, SFR_TCON, 0); ///< Interrupt 0 Type Select
SBIT (TCON_IE0, SFR_TCON, 1); ///< External Interrupt 0   
SBIT (TCON_IT1, SFR_TCON, 2); ///< Interrupt 1 Type Select
SBIT (TCON_IE1, SFR_TCON, 3); ///< External Interrupt 1   
SBIT (TCON_TR0, SFR_TCON, 4); ///< Timer 0 Run Control    
SBIT (TCON_TF0, SFR_TCON, 5); ///< Timer 0 Overflow Flag  
SBIT (TCON_TR1, SFR_TCON, 6); ///< Timer 1 Run Control    
SBIT (TCON_TF1, SFR_TCON, 7); ///< Timer 1 Overflow Flag  

// TMR2CN (Timer 2 Control)
#define SFR_TMR2CN 0xC8
SBIT (TMR2CN_T2XCLK0, SFR_TMR2CN, 0); ///< Timer 2 External Clock Select Bit 0
SBIT (TMR2CN_T2XCLK1, SFR_TMR2CN, 1); ///< Timer 2 External Clock Select Bit 1
SBIT (TMR2CN_TR2,     SFR_TMR2CN, 2); ///< Timer 2 Run Control                
SBIT (TMR2CN_T2SPLIT, SFR_TMR2CN, 3); ///< Timer 2 Split Mode Enable          
SBIT (TMR2CN_TF2CEN,  SFR_TMR2CN, 4); ///< Timer 2 Capture Enable             
SBIT (TMR2CN_TF2LEN,  SFR_TMR2CN, 5); ///< Timer 2 Low Byte Interrupt Enable  
SBIT (TMR2CN_TF2L,    SFR_TMR2CN, 6); ///< Timer 2 Low Byte Overflow Flag     
SBIT (TMR2CN_TF2H,    SFR_TMR2CN, 7); ///< Timer 2 High Byte Overflow Flag    

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn      0  ///< External Interrupt 0               
#define TIMER0_IRQn    1  ///< Timer 0 Overflow                   
#define INT1_IRQn      2  ///< External Interrupt 1               
#define TIMER1_IRQn    3  ///< Timer 1 Overflow                   
#define UART0_IRQn     4  ///< UART 0                             
#define TIMER2_IRQn    5  ///< Timer 2 Overflow                   
#define SPI0_IRQn      6  ///< SPI0                               
#define SMBUS0_IRQn    7  ///< SMBus 0                            
#define RTC0ALARM_IRQn 8  ///< RTC0 Alarm                         
#define ADC0WC_IRQn    9  ///< ADC0 Window Compare                
#define ADC0EOC_IRQn   10 ///< ADC0 End of Conversion             
#define PCA0_IRQn      11 ///< PCA0                               
#define DMA0MID_IRQn   12 ///< DMA0 Midpoint Operation Complete   
#define DMA0FULL_IRQn  13 ///< DMA0 Full-Length Operation Complete
#define TIMER3_IRQn    14 ///< Timer 3 Overflow                   
#define PMATCH_IRQn    16 ///< Port Match                         
#define RTC0FAIL_IRQn  17 ///< RTC0 Oscillator Fail               
#define MAC0_IRQn      18 ///< MAC0                               
#define CS0EOC_IRQn    19 ///< CS0 End of Conversion              
#define CS0DCMP_IRQn   20 ///< CS0 Digital Comparator             
#define CS0EOS_IRQn    21 ///< CS0 End of Scan                    
#define I2C0_IRQn      22 ///< I2C Slave 0                        

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define ADC0_PAGE    0x00 ///<                                    
#define AMUX0_PAGE   0x00 ///< Analog Multiplexer Page            
#define CRC0_PAGE    0x00 ///<                                    
#define CS0_PAGE     0x00 ///<                                    
#define LEGACY_PAGE  0x00 ///< Legacy SFR Page                    
#define PCA0_PAGE    0x00 ///<                                    
#define PMU0_PAGE    0x00 ///<                                    
#define RTC0_PAGE    0x00 ///<                                    
#define SMBUS0_PAGE  0x00 ///<                                    
#define SPI0_PAGE    0x00 ///<                                    
#define TIMER01_PAGE 0x00 ///<                                    
#define TIMER2_PAGE  0x00 ///<                                    
#define TIMER3_PAGE  0x00 ///<                                    
#define UART0_PAGE   0x00 ///<                                    
#define CONFIG_PAGE  0x0F ///< System and Port Configuration Page 
#define DMA0_PAGE    0x0F ///<                                    
#define I2C0_PAGE    0x0F ///< I2C Slave 0 Page                   
#define MAC0_PAGE    0x0F ///< Multiply and Accumulate (MAC0) Page

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------

#if defined SDCC

SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_C8051F970_DEFS_H
//-eof--------------------------------------------------------------------------

